{
    "categories": [
        {"name": "fundamental", "displayName": "Fundamentals"}
    ],
    "tutorials": [
        {
            "name": "3BallCascade",
            "displayName": "3 Ball Cascade",
            "category": "fundamental",
            "headerImages": ["3ballCascade.gif"],
            "content": [
                {"text": "The 3 ball \"cascade\" is the most basic juggling pattern and provides the foundation for all juggling patterns. Frequent practice is better than infrequent long sessions. Everyone learns at a different pace, but with practice you can definitely learn this pattern. Once you are comfortable running a 3 ball cascade for several rounds you should move on to more advanced patterns."},
                {"text": "Stop doing a 2 ball \"shower\". While there is no generally agreed upon definition of what makes a true \"juggling pattern\", this simple exchange does not provide a meaningful foundation for any growth.", "img": "2ballShower.gif"},
                {"text": "Practice the 2 ball exchange, changing which hand throws first each time. Vary your throw heights and how long you wait before throwing the second ball. You do not need to rush the 2nd throw. Try to throw and catch as low as you can.", "img": "2ballExchange.gif"},
                {"text": "Focus on making exagerated \"scoops\" with your hands. Cascade throws should be made close to the center of your body and caught on the outside.", "img": "2ballExchangeWithPaths.gif"},
                {"text": "Don't feel like your 2 ball exchange has to be perfect, the earlier you start trying 3 balls the better. Practice short controlled runs instead of trying to 'break you record' every time. Throwing and catching with 2 balls in one hand can be challening. During the first throw and final catch try to throw/catch using your fingers while holding the other ball with your palm and thumb.", "img": "3ballRun.gif"},
                {"text": "It's very common to keep throwing too far in front of you. Work to keep the pattern in 1 plane. It may help to practice in front of a wall in order to prevent yourself from throwing forward.", "img": "3ballCascadeSideView.gif"}                
            ]
        },
        {
            "name": "ReverseCascade",
            "displayName": "Reverse Cascade",
            "category": "fundamental",
            "headerImages": ["ReverseCascade.gif"],
            "content": [
                {"text": "The reverse cascade is the same as the regular cascade except all throws are made from the outside, instead of the inside. The main idea to take away from this is that you can throw a ball from anywhere that your hand can reach, which opens up a whole world of possibilities - under the leg, behind the back, and various places around your body. You should aim to master the reverse cascade (all outside throws), but along the way you can pick up a number of interesting tricks."},
                {"text": "You should start by incorporating a single outside throw into your 3 ball cascade. You may have to vary the timing and spacing of your pattern to accomodate this throw (you may experience a lot of collisions while practicing this). Remember to keep the pattern in one plane! Some may call this trick 'one over the top' or something like that. Experiment with different heights and timing.", "img": "OutsideThrow.gif"},
                {"text": "A very common and fun trick you can learn while mastering the reverse cascade is 'tennis'. Use outside throws for one of the balls, throwing the same ball over the top every time.", "img": "Tennis.gif"}
            ]
        },
        {
            "name": "Columns",
            "displayName": "Columns",
            "category": "fundamental",
            "headerImages": ["Columns.gif"],
            "content": [
                {"text": "'Columns' is aptly named as each ball goes up and down in its own column. This pattern introduces an important concept - throwing two balls at the same time. This is known as a 'synchronous' or 'sync' pattern, whereas the cascade, and other patterns with alternating left/right throws, are called 'asynchronous'."},
                {"text": "Practice throwing 2 balls to the same height. There's really not much more to this step.", "img": "2BallColumns.gif"},
                {"text": "Practice juggling 2 balls in one hand. For the sake of this pattern try to keep them in separate columns, though you should practice with inside and outside throws as well.", "img": "2Balls1Hand.gif"},
                {"text": "Once you can run columns you should practice using different hands for the middle ball.", "img": "ColumnsAlternating.gif"},
                {"text": "In addition to alternating hands, incorporate inside and outside throws. Columns provides a solid foundation for exploration of many different tricks.", "img": "ColumnsMod.gif"}
            ]
        }
    ]
}